; domain
;; The travel domain of Lecture 10, with the methods thrown away.
;; The four actions are identical to those in travel.hddl. Only the hierarchy is gone,
;; so a classical planner has to find the sequence for itself.
(define (domain travel-classical)
  (:requirements :strips :negative-preconditions)
  (:predicates (at ?x) (airport ?a ?c) (longDistance ?x ?y) (ticket ?x ?y) (hasTaxi ?x))

  (:action getTicket
    :parameters (?x ?y ?xc ?yc)
    :precondition (and (airport ?x ?xc) (airport ?y ?yc))
    :effect (and (ticket ?x ?y)))

  (:action fly
    :parameters (?x ?y ?x1 ?y1)
    :precondition (and (airport ?x ?x1) (airport ?y ?y1) (ticket ?x ?y) (at ?x))
    :effect (and (not (at ?x)) (not (ticket ?x ?y)) (at ?y)))

  (:action getTaxi
    :parameters (?x)
    :precondition (and (at ?x))
    :effect (and (hasTaxi ?x)))

  (:action rideTaxi
    :parameters (?x ?y)
    :precondition (and (at ?x) (not (longDistance ?x ?y)) (hasTaxi ?x))
    :effect (and (not (at ?x)) (not (hasTaxi ?x)) (at ?y)))
)

; problem
;; pb1-classical, with the missing longDistance facts asserted.
;; Every pair of locations in different cities is far apart, in both directions,
;; which is what the HTN methods were quietly assuming and the actions never said.
(define (problem pb1-classical-fixed)
  (:domain travel-classical)
  (:objects portoalegre saopaulo london poa gru lhr)
  (:init (at portoalegre)
         (airport poa portoalegre) (airport gru saopaulo) (airport lhr london)
         (longDistance portoalegre saopaulo)
         (longDistance portoalegre london)
         (longDistance portoalegre gru)
         (longDistance portoalegre lhr)
         (longDistance saopaulo portoalegre)
         (longDistance saopaulo london)
         (longDistance saopaulo poa)
         (longDistance saopaulo lhr)
         (longDistance london portoalegre)
         (longDistance london saopaulo)
         (longDistance london poa)
         (longDistance london gru)
         (longDistance poa saopaulo)
         (longDistance poa london)
         (longDistance poa gru)
         (longDistance poa lhr)
         (longDistance gru portoalegre)
         (longDistance gru london)
         (longDistance gru poa)
         (longDistance gru lhr)
         (longDistance lhr portoalegre)
         (longDistance lhr saopaulo)
         (longDistance lhr poa)
         (longDistance lhr gru)
  )
  (:goal (at saopaulo))
)

; plan
1. (getticket poa gru portoalegre saopaulo)
   added: (ticket poa gru)
   goals met: 0 of 1
2. (gettaxi portoalegre)
   added: (hastaxi portoalegre)
   goals met: 0 of 1
3. (ridetaxi portoalegre poa)
   deleted: (at portoalegre) (hastaxi portoalegre)
   added: (at poa)
   goals met: 0 of 1
4. (fly poa gru portoalegre saopaulo)
   deleted: (at poa) (ticket poa gru)
   added: (at gru)
   goals met: 0 of 1
5. (gettaxi gru)
   added: (hastaxi gru)
   goals met: 0 of 1
6. (ridetaxi gru saopaulo)
   deleted: (at gru) (hastaxi gru)
   added: (at saopaulo)
   goals met: 1 of 1
